app/views/events/_all_future.html.erb

<h3>Upcoming Events:</h3>
<% @events.future_events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE (date > '2025-05-31 16:01:46.458378') ORDER BY "events"."created_at" DESC