app/views/events/_all_past.html.erb

SELECT "events".* FROM "events" WHERE (date < '2025-05-31 16:01:22.135093') ORDER BY "events"."created_at" DESC
---
<div class="card-title"><h3>Past Events</h3></div>
<% @events.past_events.each do |event| %>