app/views/events/show.html.erb

SELECT "users".* FROM "users" INNER JOIN "attendances" ON "users"."id" = "attendances"."attendee_id" WHERE "attendances"."attended_event_id" = 21
---
<% if %>
<% @event.user_id != current_user.id && current_user.attended_events.include?(@event.id) %>