app/controllers/attendances_controller.rb

INSERT INTO "attendances" ("created_at", "updated_at", "attendee_id", "attended_event_id") VALUES ('2025-05-28 21:56:16.194662', '2025-05-28 21:56:16.194662', 1, 9) RETURNING "id"
---
  def create
    if Attendance.find_by(attendance_params).nil?
      @attendance = Attendance.new(attendance_params)
      respond_to do |format|
        if @attendance.save

DELETE FROM "attendances" WHERE "attendances"."id" = 4
---
  def destroy
    @attendance = Attendance.find_by(attending_params)
    if @attendance.nil?
      flash.alert = 'this event attendance doesnt exist'
    else
      @attendance.destroy