app/controllers/events_controller.rb

  def index
    @event = Event.new
    @events = Event.all.order(created_at: :desc)
---
SELECT "events".* FROM "events" WHERE (date > '2025-05-25 21:27:37.492701') ORDER BY "events"."created_at" DESC

  def update
    @event = Event.find(params[:id])
    if @event.update(event_params)
---
SELECT "events".* FROM "events" WHERE "events"."id" = 7 LIMIT 1
UPDATE "events" SET "updated_at" = '2025-05-26 21:36:30.045218', "body" = 'we''ll watch some gosh-darn horror movies together' WHERE "events"."id" = 7

  def destroy
    @event = Event.find(params[:id])
    flash.alert = if @event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = 7 LIMIT 1
DELETE FROM "events" WHERE "events"."id" = 7

  def create
    @event = Event.new(event_params)
    @event.user = current_user
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("created_at", "updated_at", "title", "location", "body", "user_id", "date") VALUES ('2025-05-29 20:42:19.630882', '2025-05-29 20:42:19.630882', 'my childhood', 'all over the world', 'enter only if prepared.', 1, '1986-01-08') RETURNING "id"