app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "updated_at", "title", "location", "body", "user_id") VALUES ('2025-04-22 00:14:24.146927', '2025-04-22 00:14:24.146927', 'ddv', 'cdv', 'k dv', 1) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    @event.user = current_user
    respond_to do |format|
      if @event.save