app/controllers/profiles_controller.rb

  def show
    @hosted_events = current_user.events.all
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = 1