app/controllers/profiles_controller.rb

  def show
    @profile = User.find(current_user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1